In [1]:
from datetime import datetime
import pandas_datareader.data as web

In [2]:
s1 = web.DataReader('000333.SZ', 'yahoo')

In [3]:
import pandas as pd

In [4]:
s2 = web.DataReader('300356.SZ', 'yahoo')

In [5]:
data = {'s1': s1, 's2': s2}

In [6]:
p = pd.Panel(data)

In [7]:
p

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 1881 (major_axis) x 6 (minor_axis)
Items axis: s1 to s2
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-25 00:00:00
Minor_axis axis: Open to Volume

In [8]:
p.minor_xs('Close')

                   s1     s2
Date
2010-01-04  14.913300    NaN
2010-01-05  14.460000    NaN
2010-01-06  14.200000    NaN
2010-01-07  13.846700    NaN
2010-01-08  14.080000    NaN
2010-01-11  13.586700    NaN
2010-01-12  13.933300    NaN
2010-01-13  13.806700    NaN
2010-01-14  14.226700    NaN
2010-01-15  14.206700    NaN
2010-01-18  13.953300    NaN
2010-01-19  13.966700    NaN
2010-01-20  13.340000    NaN
2010-01-21  13.166700    NaN
2010-01-22  12.853300    NaN
2010-01-25        NaN    NaN
2010-01-26  12.853300    NaN
2010-01-27  13.106700    NaN
2010-01-28  13.333300    NaN
2010-01-29  13.126700    NaN
2010-02-01  13.366700    NaN
2010-02-02  13.686700    NaN
2010-02-03  13.706700    NaN
2010-02-04  13.306700    NaN
2010-02-05  12.866700    NaN
2010-02-08  12.813300    NaN
2010-02-09  12.526700    NaN
2010-02-10  12.700000    NaN
2010-02-11  13.233300    NaN
2010-02-12  13.300000    NaN
...               ...    ...
2017-08-15  39.770000   9.31
2017-08-16  39.049999   9.49
2017-08-17  39.320000  10.14
2017-08-18  39.130001   9.89
2017-08-21  39.709999  10.05
2017-08-22  40.450001   9.78
2017-08-23  40.810001   9.81
2017-08-24  41.520000   9.69
2017-08-25  41.900002   9.76
2017-08-28  42.270000   9.87
2017-08-29  41.700001   9.79
2017-08-30  41.980000   9.65
2017-08-31  41.000000   9.58
2017-09-01  40.840000   9.80
2017-09-04  41.360001   9.91
2017-09-05  41.410000   9.89
2017-09-06  40.970001  10.38
2017-09-07  40.970001  10.18
2017-09-08  40.990002  10.39
2017-09-11  40.310001  10.60
2017-09-12  40.220001  10.47
2017-09-13  41.189999  10.31
2017-09-14  40.900002  10.32
2017-09-15  42.029999  10.14
2017-09-18  42.029999  10.30
2017-09-19  42.000000  10.18
2017-09-20  43.290001  10.22
2017-09-21  43.099998  10.04
2017-09-22  44.099998  10.16
2017-09-25  43.320000  10.05

[1881 rows x 2 columns]

In [9]:
p.minor_xs('Close').min().min()

3.8986699999999996

In [10]:
p.major_xs('2017-09-21')

                     s1          s2
Open       4.338000e+01       10.25
High       4.390000e+01       10.25
Low        4.295000e+01       10.03
Close      4.310000e+01       10.04
Adj Close  4.310000e+01       10.04
Volume     3.262212e+07  5096550.00

In [11]:
p.major_xs(p.major_axis[1])

                     s1  s2
Open       1.466670e+01 NaN
High       1.486000e+01 NaN
Low        1.426670e+01 NaN
Close      1.446000e+01 NaN
Adj Close  1.117139e+01 NaN
Volume     2.518916e+07 NaN

In [12]:
p.major_axis[1]

Timestamp('2010-01-05 00:00:00')

In [13]:
import numpy as np

In [14]:
z=np.zeros((4,2))

In [15]:
t = p.major_xs(p.major_axis[1])

In [16]:
t

                     s1  s2
Open       1.466670e+01 NaN
High       1.486000e+01 NaN
Low        1.426670e+01 NaN
Close      1.446000e+01 NaN
Adj Close  1.117139e+01 NaN
Volume     2.518916e+07 NaN

In [17]:
t['s1']['Close']

14.460000000000001

In [18]:
t['s2']['Close'] == None

False

In [19]:
t['s2']['Close'] == np.nan

False

In [20]:
np.isnan(t['s2']['Close'])

True

In [21]:
t.ffill()

                     s1  s2
Open       1.466670e+01 NaN
High       1.486000e+01 NaN
Low        1.426670e+01 NaN
Close      1.446000e+01 NaN
Adj Close  1.117139e+01 NaN
Volume     2.518916e+07 NaN